FKDD_COPY_DIFF_3_2026-02-14/Catalogs/Нормочасы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Нормочасы</Name>
			<Comment>Нормочасы авторабот</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Валюта нормочаса</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена нормочаса</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Catalogs/Нормочасы/Ext/ManagerModule.bsl
// Процедура заполнения предопределенных элементов
Процедура ЗаполнитьПредопределенныеЭлементы(ЗаполнятьВсе=Ложь) Экспорт
	ЭлементСправочника=Справочники.Нормочасы.Рубль.ПолучитьОбъект();
	ВалютаРубль=Справочники.Валюты.НайтиПоКоду("643");
	Если ЗаполнятьВсе Тогда
		ЭлементСправочника.Валюта=ВалютаРубль;
		ЭлементСправочника.Цена=1;
	Иначе
		Если обЗначениеНеЗаполнено(ЭлементСправочника.Валюта) Тогда
			ЭлементСправочника.Валюта=ВалютаРубль;
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ЭлементСправочника.Цена) Тогда
			ЭлементСправочника.Цена=1;
		КонецЕсли;
	КонецЕсли;
	//Сохранение справочника
	Если ЭлементСправочника.Модифицированность() Тогда
		Попытка		
			ЭлементСправочника.Записать();
			Сообщить("Справочник ""Нормочасы"". Обновлен элемент """+СокрЛП(ЭлементСправочника.Наименование)+"""");
		Исключение
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры
